In [143]:
# Add the Pandas dependency.
import pandas as pd
#for second method
#import os (if i am using the second method of loding csv file to jupyter)
#school_data_to_load = os.path.join("Resources", "schools_complete.csv")
#student_data_to_load = os.path.join("Resources", "students_complete.csv")

In [144]:
# Files to load
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

In [145]:
# Read the school data file and store it in a Pandas DataFrame.
school_data_df = pd.read_csv(school_data_to_load)
school_data_df

    School ID            school_name      type  size   budget
0           0      Huang High School  District  2917  1910635
1           1   Figueroa High School  District  2949  1884411
2           2    Shelton High School   Charter  1761  1056600
3           3  Hernandez High School  District  4635  3022020
4           4    Griffin High School   Charter  1468   917500
5           5     Wilson High School   Charter  2283  1319574
6           6    Cabrera High School   Charter  1858  1081356
7           7     Bailey High School  District  4976  3124928
8           8     Holden High School   Charter   427   248087
9           9       Pena High School   Charter   962   585858
10         10     Wright High School   Charter  1800  1049400
11         11  Rodriguez High School  District  3999  2547363
12         12    Johnson High School  District  4761  3094650
13         13       Ford High School  District  2739  1763916
14         14     Thomas High School   Charter  1635  1043130

In [146]:
#To view the first five rows of a DataFrame
school_data_df.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [147]:
#To view the last five rows of a DataFrame
school_data_df.tail()

    School ID            school_name      type  size   budget
10         10     Wright High School   Charter  1800  1049400
11         11  Rodriguez High School  District  3999  2547363
12         12    Johnson High School  District  4761  3094650
13         13       Ford High School  District  2739  1763916
14         14     Thomas High School   Charter  1635  1043130

In [148]:
#To view any number of rows in a DataFrame in top rows
school_data_df.head(8)

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500
5          5     Wilson High School   Charter  2283  1319574
6          6    Cabrera High School   Charter  1858  1081356
7          7     Bailey High School  District  4976  3124928

In [149]:
#To view any number of rows in a DataFrame in last rows
school_data_df.tail(10)

    School ID            school_name      type  size   budget
5           5     Wilson High School   Charter  2283  1319574
6           6    Cabrera High School   Charter  1858  1081356
7           7     Bailey High School  District  4976  3124928
8           8     Holden High School   Charter   427   248087
9           9       Pena High School   Charter   962   585858
10         10     Wright High School   Charter  1800  1049400
11         11  Rodriguez High School  District  3999  2547363
12         12    Johnson High School  District  4761  3094650
13         13       Ford High School  District  2739  1763916
14         14     Thomas High School   Charter  1635  1043130

In [150]:
# Read the student data file and store it in a Pandas DataFrame.
student_data_df = pd.read_csv(student_data_to_load)
student_data_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [151]:
 # Determine if there are any missing values in the school data using count method
school_data_df.count()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

In [152]:
# Determine if there are any missing values in the student data using count method
student_data_df.count()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [153]:
# Determine if there are any missing values in the school data using isnull method
school_data_df.isnull()

    School ID  school_name   type   size  budget
0       False        False  False  False   False
1       False        False  False  False   False
2       False        False  False  False   False
3       False        False  False  False   False
4       False        False  False  False   False
5       False        False  False  False   False
6       False        False  False  False   False
7       False        False  False  False   False
8       False        False  False  False   False
9       False        False  False  False   False
10      False        False  False  False   False
11      False        False  False  False   False
12      False        False  False  False   False
13      False        False  False  False   False
14      False        False  False  False   False

In [154]:
# Determine if there are any missing values in the student data using isnull method
student_data_df.isnull()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...
39165,False,False,False,False,False,False,False
39166,False,False,False,False,False,False,False
39167,False,False,False,False,False,False,False
39168,False,False,False,False,False,False,False
39169,False,False,False,False,False,False,False

In [155]:
# to get the total number of empty rows or rows that are true using isnull method
student_data_df.isnull().sum()

Student ID       0
student_name     0
gender           0
grade            0
school_name      0
reading_score    0
math_score       0
dtype: int64

In [156]:
# Determine if there are not any missing values in the school data using notnull method
# this is opposite of isnull method
school_data_df.notnull()

    School ID  school_name  type  size  budget
0        True         True  True  True    True
1        True         True  True  True    True
2        True         True  True  True    True
3        True         True  True  True    True
4        True         True  True  True    True
5        True         True  True  True    True
6        True         True  True  True    True
7        True         True  True  True    True
8        True         True  True  True    True
9        True         True  True  True    True
10       True         True  True  True    True
11       True         True  True  True    True
12       True         True  True  True    True
13       True         True  True  True    True
14       True         True  True  True    True

In [157]:
# to get the total number of empty rows or rows that are false using notnull method
student_data_df.notnull().sum()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [158]:
# Determine data types for the school DataFrame.
school_data_df.dtypes

School ID       int64
school_name    object
type           object
size            int64
budget          int64
dtype: object

In [159]:
#find the data type of the budget column in the school data DataFrame
school_data_df.budget.dtype
#school_data_df["School ID"].dtype

dtype('int64')

In [160]:
# Determine data types for the student DataFrame.
student_data_df.dtypes

Student ID        int64
student_name     object
gender           object
grade            object
school_name      object
reading_score     int64
math_score        int64
dtype: object

In [161]:
# Add each prefix and suffix to remove to a list.
prefixes_suffixes = ["Dr. ", "Mr. ","Ms. ", "Mrs. ", "Miss ", " MD", " DDS", " DVM", " PhD"]

# Iterate through the words in the "prefixes_suffixes" list and replace them with an empty space, "".
for word in prefixes_suffixes:
    student_data_df["student_name"] = student_data_df["student_name"].str.replace(word,"")
student_data_df.head(10)

C:\Users\qasee\anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:6: FutureWarning: The default value of regex will change from True to False in a future version.

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84
5,5,Bryan Miranda,M,9th,Huang High School,94,94
6,6,Sheena Carter,F,11th,Huang High School,82,80
7,7,Nicole Baker,F,12th,Huang High School,96,69
8,8,Michael Roth,M,10th,Huang High School,95,87
9,9,Matthew Greene,M,10th,Huang High School,96,84

In [162]:
# Combine the data into a single dataset.
school_data_complete_df = pd.merge(student_data_df, school_data_df, on = ["school_name", "school_name"])
school_data_complete_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [163]:
# Get the total number of students.
student_count = school_data_complete_df.count()
student_count

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
School ID        39170
type             39170
size             39170
budget           39170
dtype: int64

In [164]:
# get the total number of students with reference to the student ID 
student_count = school_data_complete_df["Student ID"].count()
student_count

39170

In [165]:
# to calculate total number of  schools, we can also calculate in this way
# school_count = school_data_df['school_name'].count
#school_count

# Calculate the total number of schools
school_count2 = school_data_complete_df["school_name"].unique()
school_count2

array(['Huang High School', 'Figueroa High School', 'Shelton High School',
       'Hernandez High School', 'Griffin High School',
       'Wilson High School', 'Cabrera High School', 'Bailey High School',
       'Holden High School', 'Pena High School', 'Wright High School',
       'Rodriguez High School', 'Johnson High School', 'Ford High School',
       'Thomas High School'], dtype=object)

In [166]:
# total number of schools
school_count = len(school_count2)
school_count

15

In [167]:
# calculate the total budget of schoolse
total_budget = school_data_df['budget'].sum()
total_budget

24649428

In [168]:
# Calculate the average reading score.
average_reading_score = school_data_complete_df['reading_score'].mean()
average_reading_score

81.87784018381414

In [169]:
# Calculate the average math score.
average_math_score = school_data_complete_df['math_score'].mean()
average_math_score

78.98537145774827

In [170]:
#determine the passing grade
passing_math = school_data_complete_df['math_score'] >=70
passing_reading = school_data_complete_df['reading_score'] >=70

In [171]:
passing_math

0         True
1        False
2        False
3        False
4         True
         ...
39165     True
39166     True
39167     True
39168     True
39169     True
Name: math_score, Length: 39170, dtype: bool

In [172]:
passing_reading

0        False
1         True
2         True
3        False
4         True
         ...
39165     True
39166     True
39167     True
39168     True
39169     True
Name: reading_score, Length: 39170, dtype: bool

In [173]:
# Get all the students who are passing math in a new DataFrame.
#passing_math2 = school_data_complete_df[passing_math]
#passing_math2
# or we can write like this 
passing_math = school_data_complete_df[school_data_complete_df['math_score'] >=70]
passing_math.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635

In [174]:
# Get all the students that are passing reading in a new DataFrame.
passing_reading = school_data_complete_df[school_data_complete_df['reading_score'] >=70]
passing_reading.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635

In [175]:
# Calculate the number of students passing math.
passing_math_count = passing_math['student_name'].count()
passing_math_count

29370

In [176]:
# Calculate the number of students passing reading
passing_reading_count = passing_reading['student_name'].count()
passing_reading_count

33610

In [177]:
# Calculate the percent that passed math.
passing_math_percentage = passing_math_count / float(student_count) *100
passing_math_percentage

74.9808526933878

In [178]:
# Calculate the percent that passed reading
passing_reading_percentage = passing_reading_count / float(student_count) * 100
passing_reading_percentage

85.80546336482001

In [179]:
# Calculate the students who passed both math and reading.
passing_math_reading = school_data_complete_df[(school_data_complete_df["math_score"] >= 70) & (school_data_complete_df["reading_score"] >= 70)]
passing_math_reading.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635
9,9,Matthew Greene,M,10th,Huang High School,96,84,0,District,2917,1910635

In [180]:
# Calculate the number of students who passed both math and reading.
overall_passing_math_reading_count = passing_math_reading['student_name'].count()
overall_passing_math_reading_count

25528

In [181]:
# Calculate the overall passing percentage.
overall_passing_percentage = overall_passing_math_reading_count / float(student_count) *100
overall_passing_percentage

65.17232575950983

In [182]:
# Adding a list of values with keys to create a new DataFrame.
district_summary_df = pd.DataFrame([{'Total schools' : school_count , 
                                      'Total student': student_count, 
                                      'Total budget' : total_budget,
                                      'Average Math Score' : average_math_score, 
                                      'Average reading score' : average_reading_score,
                                      '% passing math': passing_math_percentage, 
                                      '% passing reading': passing_reading_percentage,
                                      'Overall Passing': overall_passing_percentage}])
district_summary_df

,Total schools,Total student,Total budget,Average Math Score,Average reading score,% passing math,% passing reading,Overall Passing
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,65.172326

In [183]:
# Define a function that calculates the percentage of students that passed both 
# math and reading and returns the passing percentage when the function is called.
def passing_math_percent(pass_math_count, student_count):
    return pass_math_count/float (student_count) * 100

In [184]:
pass_math_count = 29370
student_count = 39170

In [185]:
# Call the function.
passing_math_percent(pass_math_count, student_count)

74.9808526933878

In [186]:
# Format the "Total Students" to have the comma for a thousands separator.
district_summary_df["Total student"] = district_summary_df["Total student"].map("{:,}".format)
district_summary_df["Total student"]

0    39,170
Name: Total student, dtype: object

In [187]:
# Format "Total Budget" to have the comma for a thousands separator, a decimal separator, and a "$".
district_summary_df['Total budget'] = district_summary_df['Total budget'].map("${:,.2f}".format)
district_summary_df['Total budget']

0    $24,649,428.00
Name: Total budget, dtype: object

In [188]:
# Format the columns.

district_summary_df['Average reading score'] = district_summary_df['Average reading score'].map("{:.1f}".format)
district_summary_df['Average reading score']

0    81.9
Name: Average reading score, dtype: object

In [189]:
district_summary_df['Average Math Score']=district_summary_df['Average Math Score'].map("{:.1f}".format)
district_summary_df['Average Math Score']

0    79.0
Name: Average Math Score, dtype: object

In [190]:
district_summary_df['% passing reading']=district_summary_df['% passing reading'].map("{:.0f}".format)
district_summary_df['% passing reading']

0    86
Name: % passing reading, dtype: object

In [191]:
district_summary_df['% passing math']=district_summary_df['% passing math'].map("{:.0f}".format)
district_summary_df['% passing math']

0    75
Name: % passing math, dtype: object

In [192]:
district_summary_df['Overall Passing'] = district_summary_df['Overall Passing'].map("{:.0f}".format)
district_summary_df['Overall Passing']

0    65
Name: Overall Passing, dtype: object

In [193]:
district_summary_df

,Total schools,Total student,Total budget,Average Math Score,Average reading score,% passing math,% passing reading,Overall Passing
0,15,"39,170","$24,649,428.00",79.0,81.9,75,86,65

In [194]:
# Reorder the columns in the order you want them to appear.
new_coloumn_order = ['Total schools','Total student','Total budget','Average Math Score','Average reading score', '% passing math', '% passing reading','Overall Passing']

# Assign district summary df the new column order.
district_summary_df = district_summary_df[new_coloumn_order]
district_summary_df

,Total schools,Total student,Total budget,Average Math Score,Average reading score,% passing math,% passing reading,Overall Passing
0,15,"39,170","$24,649,428.00",79.0,81.9,75,86,65